<?php
/*
 * 个人中心入口 -- 请假模块的配置
 *
 * @author  Devin
 * @version  1.0
 * @date  2017-03-01
 */

namespace apps\office\center;


/*
 * 请假模块的各种配置
 *
 * @author  Devin
 * @version  1.0
 * @date  2017-03-01
 *
 */
class MLeave_conf {

    public static $holiday_conf = array(
        '2017' => array(
            'holiday' => array(
                '01/01', '01/02', '01/27', '01/28', '01/29', '01/30', '01/31',
                '02/01', '02/02',
                '04/02', '04/03', '04/04', '04/29', '04/30',
                '05/01', '05/28', '05/29', '05/30',
                '10/01', '10/02', '10/03', '10/04', '10/05', '10/06', '10/07', '10/08',
            ),
            'weekday_need_work' => array(
                '01/22',
                '02/04',
                '04/01',
                '05/27',
                '09/30'
            ),
        ),
    );

    /*
     * 后台管理系统入口配置文件
     */
    public static $permission_conf = array(
        'admin' => array(
            '34627587',
            '38719370',     //曹迪
            '730240',       //慈轶恒
            '10009',        //张矗
            '63344676',     //顾美晨
            '19173802'      //贾媛

        ),

        'hr' => array(
            '34627587',
            '771392',       //田淼
        )
    );
}